import AboutUsImgMan from '../assets/images/AboutUsImgMan.svg';
import AboutUsImgWoman from '../assets/images/AboutUsImgWoman.svg';

export const AboutUsData = [
    {
        title: 'Миссия',
        text: 'Создать условия для успешной реализации потенциала каждого связанного с уличными дисциплинами в духовной и профессиональной сфере.',
    },
    {
        title: 'Идея',
        text: 'Идея создания единого сообщества улиц в разных регионах нашей страны появилась на основе уличных субкультур, которые объединяли тысячи людей из разных городов и стран.',
    },
    {
        title: 'Цели',
        text: 'Комплексное развитие уличной культуры и спорта. Популяризация уличных дисциплин.Создание положительного образа в информационном пространстве у дисциплин, которые считаются травмоопасными и агрессивными.',
    },
];

export const AboutUsImgData = [{ img: AboutUsImgMan }, { img: AboutUsImgWoman }];
